wrk_rps_merged/227
Running 5m test @ http://10.97.218.132:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 184.083ms, rate sampling interval: 829ms
  Thread calibration: mean lat.: 196.378ms, rate sampling interval: 822ms
  Thread calibration: mean lat.: 210.443ms, rate sampling interval: 851ms
  Thread calibration: mean lat.: 214.824ms, rate sampling interval: 881ms
  Thread calibration: mean lat.: 222.125ms, rate sampling interval: 915ms
  Thread calibration: mean lat.: 220.343ms, rate sampling interval: 924ms
  Thread calibration: mean lat.: 218.828ms, rate sampling interval: 854ms
  Thread calibration: mean lat.: 232.759ms, rate sampling interval: 891ms
  Thread calibration: mean lat.: 232.672ms, rate sampling interval: 897ms
  Thread calibration: mean lat.: 224.065ms, rate sampling interval: 900ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   207.64ms  189.88ms   1.51s    80.61%
    Req/Sec     9.53      3.35    24.00     77.63%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  155.01ms
 75.000%  268.29ms
 90.000%  411.90ms
 99.000%  946.69ms
 99.900%    1.42s 
 99.990%    1.50s 
 99.999%    1.51s 
100.000%    1.51s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.466     0.000000            1         1.00
      26.799     0.100000         2903         1.11
      53.727     0.200000         5802         1.25
     119.039     0.300000         8704         1.43
     136.063     0.400000        11611         1.67
     155.007     0.500000        14510         2.00
     205.951     0.550000        15956         2.22
     218.623     0.600000        17419         2.50
     227.327     0.650000        18865         2.86
     236.415     0.700000        20310         3.33
     268.287     0.750000        21760         4.00
     306.943     0.775000        22496         4.44
     315.391     0.800000        23226         5.00
     323.071     0.825000        23943         5.71
     332.543     0.850000        24659         6.67
     351.487     0.875000        25386         8.00
     401.151     0.887500        25747         8.89
     411.903     0.900000        26111        10.00
     422.911     0.912500        26476        11.43
     437.247     0.925000        26838        13.33
     501.759     0.937500        27197        16.00
     517.631     0.943750        27387        17.78
     536.063     0.950000        27561        20.00
     578.047     0.956250        27741        22.86
     631.295     0.962500        27924        26.67
     661.503     0.968750        28107        32.00
     717.823     0.971875        28197        35.56
     736.255     0.975000        28287        40.00
     756.223     0.978125        28377        45.71
     821.759     0.981250        28469        53.33
     839.167     0.984375        28557        64.00
     864.767     0.985938        28603        71.11
     920.063     0.987500        28649        80.00
     932.863     0.989062        28693        91.43
    1036.799     0.990625        28739       106.67
    1107.967     0.992188        28784       128.00
    1126.399     0.992969        28807       142.22
    1147.903     0.993750        28829       160.00
    1205.247     0.994531        28852       182.86
    1231.871     0.995313        28875       213.33
    1248.255     0.996094        28897       256.00
    1256.447     0.996484        28909       284.44
    1295.359     0.996875        28921       320.00
    1310.719     0.997266        28934       365.71
    1316.863     0.997656        28943       426.67
    1328.127     0.998047        28954       512.00
    1331.199     0.998242        28960       568.89
    1344.511     0.998437        28966       640.00
    1393.663     0.998633        28971       731.43
    1419.263     0.998828        28977       853.33
    1425.407     0.999023        28983      1024.00
    1427.455     0.999121        28989      1137.78
    1427.455     0.999219        28989      1280.00
    1429.503     0.999316        28991      1462.86
    1432.575     0.999414        28994      1706.67
    1435.647     0.999512        28996      2048.00
    1437.695     0.999561        28998      2275.56
    1440.767     0.999609        29000      2560.00
    1442.815     0.999658        29002      2925.71
    1442.815     0.999707        29002      3413.33
    1444.863     0.999756        29003      4096.00
    1453.055     0.999780        29004      4551.11
    1462.271     0.999805        29005      5120.00
    1499.135     0.999829        29006      5851.43
    1499.135     0.999854        29006      6826.67
    1500.159     0.999878        29007      8192.00
    1500.159     0.999890        29007      9102.22
    1501.183     0.999902        29009     10240.00
    1501.183     0.999915        29009     11702.86
    1501.183     0.999927        29009     13653.33
    1501.183     0.999939        29009     16384.00
    1501.183     0.999945        29009     18204.44
    1501.183     0.999951        29009     20480.00
    1501.183     0.999957        29009     23405.71
    1501.183     0.999963        29009     27306.67
    1506.303     0.999969        29010     32768.00
    1506.303     1.000000        29010          inf
#[Mean    =      207.642, StdDeviation   =      189.881]
#[Max     =     1505.280, Total count    =        29010]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30050 requests in 5.00m, 146.76MB read
Requests/sec:    100.16
Transfer/sec:    500.89KB