wrk_rps_merged/253
Running 5m test @ http://10.98.159.109:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 322.866ms, rate sampling interval: 1126ms
  Thread calibration: mean lat.: 334.883ms, rate sampling interval: 1213ms
  Thread calibration: mean lat.: 352.032ms, rate sampling interval: 1220ms
  Thread calibration: mean lat.: 343.401ms, rate sampling interval: 1215ms
  Thread calibration: mean lat.: 347.429ms, rate sampling interval: 1111ms
  Thread calibration: mean lat.: 354.440ms, rate sampling interval: 1212ms
  Thread calibration: mean lat.: 359.755ms, rate sampling interval: 1219ms
  Thread calibration: mean lat.: 340.053ms, rate sampling interval: 1203ms
  Thread calibration: mean lat.: 372.914ms, rate sampling interval: 1262ms
  Thread calibration: mean lat.: 363.364ms, rate sampling interval: 1219ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   356.85ms  308.35ms   2.94s    83.39%
    Req/Sec     9.53      2.48    19.00     84.09%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  317.18ms
 75.000%  426.75ms
 90.000%  595.97ms
 99.000%    1.71s 
 99.900%    2.32s 
 99.990%    2.92s 
 99.999%    2.95s 
100.000%    2.95s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.570     0.000000            1         1.00
      51.775     0.100000         2907         1.11
     150.655     0.200000         5806         1.25
     224.895     0.300000         8716         1.43
     250.367     0.400000        11612         1.67
     317.183     0.500000        14538         2.00
     328.447     0.550000        15983         2.22
     339.455     0.600000        17414         2.50
     401.151     0.650000        18896         2.86
     412.415     0.700000        20330         3.33
     426.751     0.750000        21768         4.00
     434.175     0.775000        22499         4.44
     445.183     0.800000        23226         5.00
     502.783     0.825000        23951         5.71
     513.279     0.850000        24678         6.67
     527.871     0.875000        25408         8.00
     537.599     0.887500        25754         8.89
     596.479     0.900000        26120        10.00
     613.375     0.912500        26480        11.43
     637.439     0.925000        26847        13.33
     751.615     0.937500        27208        16.00
     830.463     0.943750        27387        17.78
     914.431     0.950000        27571        20.00
     960.511     0.956250        27750        22.86
    1224.703     0.962500        27931        26.67
    1321.983     0.968750        28113        32.00
    1345.535     0.971875        28202        35.56
    1426.431     0.975000        28293        40.00
    1453.055     0.978125        28386        45.71
    1523.711     0.981250        28477        53.33
    1551.359     0.984375        28568        64.00
    1610.751     0.985938        28610        71.11
    1630.207     0.987500        28656        80.00
    1647.615     0.989062        28702        91.43
    1715.199     0.990625        28746       106.67
    1745.919     0.992188        28792       128.00
    1813.503     0.992969        28818       142.22
    1825.791     0.993750        28837       160.00
    1839.103     0.994531        28862       182.86
    1847.295     0.995313        28883       213.33
    1905.663     0.996094        28905       256.00
    1913.855     0.996484        28917       284.44
    1924.095     0.996875        28928       320.00
    1933.311     0.997266        28939       365.71
    1941.503     0.997656        28953       426.67
    1951.743     0.998047        28964       512.00
    1953.791     0.998242        28967       568.89
    1958.911     0.998437        28974       640.00
    2127.871     0.998633        28979       731.43
    2230.271     0.998828        28985       853.33
    2336.767     0.999023        28990      1024.00
    2414.591     0.999121        28994      1137.78
    2441.215     0.999219        28996      1280.00
    2455.551     0.999316        28999      1462.86
    2498.559     0.999414        29001      1706.67
    2504.703     0.999512        29004      2048.00
    2541.567     0.999561        29006      2275.56
    2551.807     0.999609        29007      2560.00
    2555.903     0.999658        29010      2925.71
    2555.903     0.999707        29010      3413.33
    2559.999     0.999756        29012      4096.00
    2559.999     0.999780        29012      4551.11
    2646.015     0.999805        29013      5120.00
    2648.063     0.999829        29014      5851.43
    2648.063     0.999854        29014      6826.67
    2922.495     0.999878        29016      8192.00
    2922.495     0.999890        29016      9102.22
    2922.495     0.999902        29016     10240.00
    2922.495     0.999915        29016     11702.86
    2922.495     0.999927        29016     13653.33
    2926.591     0.999939        29017     16384.00
    2926.591     0.999945        29017     18204.44
    2926.591     0.999951        29017     20480.00
    2926.591     0.999957        29017     23405.71
    2926.591     0.999963        29017     27306.67
    2945.023     0.999969        29018     32768.00
    2945.023     1.000000        29018          inf
#[Mean    =      356.850, StdDeviation   =      308.349]
#[Max     =     2942.976, Total count    =        29018]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30047 requests in 5.00m, 146.85MB read
Requests/sec:    100.13
Transfer/sec:    501.12KB